var index = 0;
var contentt = [
    {
        contenttext: "Windows 1.0 е 16-битова операционна система с графичен потребителски интерфейс, издадена на 20 ноември 1985 г. Това е първата операционна система от семейството на Microsoft Windows и първият опит на компанията Майкрософт да разработи многозадачна операционна среда с графичен интерфейс, предназначена за персонални компютри. Windows 2.0 се оказал малко по-популярен от предшественика си Windows 1.0. По-голямата част от популярността му се дължи на това, че е „run-time версия“ и на него работят новите графични Microsoft приложения Excel и Word. Те можели да бъдат пуснати и от MS-DOS. За да работят, при тяхното стартиране се стартирал и Windows, а след затварянето им, Windows се изключвал. ",
    },
    {
        contenttext: "Windows 3.0 е издаден през май 1990 г. като своеобразно продължение на първите две версии на операционната система от Microsoft Windows 1.0 и Windows 2.0, като предлага на потребителя много по-добър графичен интерфейс и повече възможности. Със способността си да адресира повече от 640К памет и много по-мощният интерфейс, производителите на софтуер започват да правят различни приложения за Windows 3.0, което до голяма степен помага на Microsoft да продадат над 10 милиона копия, което го прави бестселър с графична среда. Windows 95 е директен наследник на дотогава отделните продукти на „Майкрософт“ MS-DOS и Windows, както и първата система от тази линия, която не поддържа стари, 16-битови x86-процесори, а задъжително изисква Intel 80386 или съвместим с него по-бърз процесор, работещ в защите́н режим. Системата представя значителни подобрения в графичния потребителски интерфейс и други нови идеи и е първият Windows, обвързан с определена версия на DOS (DOS 7.0 на „Майкрософт“). ",
    },
    {
        contenttext: "Windows 98 нова операционна система всъщност първоначално е подобрен Windows 95 и, както предхождащата я версия, е хибриден 16-битов/32-битов продукт. Windows 98 има подобрена поддръжка на AGP и функционалност за USB-драйвъри. Други функции са възможността за използване на няколко монитора и WebTV. Internet Explorer е още по-вграден в кода на Windows, а дори и в графичния потребителски интерфейс (тази промяна е наречена Active Desktop, буквално 'активно бюро'). Microsoft Windows Millennium (или Windows Me) е смесена 16-битова/32-битова графична операционна система на Microsoft издадена на 14 септември 2000. Тя е наследник на Microsoft Windows 98 и е част от поредицата версии на Windows (98SE, 98, 95 и по-старите), изградени върху основата на MS-DOS. ",
    },
];

function getNextcontent(){
    if (index < contentt.length)
        return contentt[index++];
    else {
        return null;
    }
}



