var index = 0;
var contentt = [
    {
        contenttext: "Терминът „конзола за видеоигри“ се използва предимно за разграничаване на конзолна машина, предназначена основно за потребителите, за да се използват за игра на видео игри, за разлика от аркадните машини или домашните компютри. Аркадна машина се състои от компютър за видеоигри, дисплей, контролер за игри (джойстик, бутони и т.н.) и високоговорители, поставени в голямо или малко шаси. Домашният компютър е персонален компютър, предназначен за домашна употреба за различни цели, като счетоводство, достъп до Интернет и игра на видео игри. Въпреки че аркадите и компютрите обикновено са скъпи или високо технически устройства, конзолите за видеоигри са проектирани с достъпност и достъпност за широката общественост.",
    },
    {
        contenttext: "За разлика от подобна потребителска електроника, като музикални плейъри и филмови плейъри, които използват широко отраслови стандартни формати, конзолите за видеоигри използват собствени формати, които се конкурират помежду си за пазарен дял. Има различни видове конзоли за видеоигри, включително домашни конзоли за видеоигри, ръчни конзоли за игри, микроконзоли и специализирани конзоли. Въпреки че Ралф Баер е изградил работещи конзоли за игри до 1966 г., мина почти десетилетие, преди играта Pong да ги направи обичайни в дневните на обикновените хора. Чрез еволюцията през 90-те и 2000-те, конзолите за игри се разшириха, за да предложат допълнителни функции като CD плейъри, DVD плейъри, Blu-ray плейъри, уеб браузъри, приставки и др.",
    },
    {
        contenttext: "Конзолите за видеоигри могат да се предлагат в няколко разновидности.Домашните конзоли за видеоигри са устройства, които обикновено са предназначени за свързване към телевизор или друг вид монитор и с захранване през изход, като по този начин изискват устройството да се използва на фиксирани места. Ранните примери включват Atari 2600, Nintendo Entertainment System и Sega Genesis, докато по-новите примери включват PlayStation 4 и Xbox One.Ръчните конзоли за видеоигри са устройства, които обикновено включват вграден екран и батерия, така че устройството да може да се носи и да се играе навсякъде. Примери за това включват Game Boy, PlayStation Vita, Nintendo DS и Nintendo 3DS. Хибридните конзоли за видеоигри имат елементи както на домашни, така и на ръчни системи. Понастоящем единствената хибридна конзола е Nintendo Switch.",
    },
];

function getNextcontent(){
    if (index < contentt.length)
        return contentt[index++];
    else {
        return null;
    }
}



