var index = 0;
var contentt = [
    {
        contenttext: "През 1897 г. английският физик Дж. Дж. Томсън успял в своите три известни експеримента да отклони катодните лъчи, основна функция на съвременната катодна лъчева тръба (CRT). Най-ранната версия на CRT е изобретена от германския физик Фердинанд Браун през 1897 г. и е известна още като тръбата „Braun“. Това беше диод със студен катод, модификация на тръбата на Crookes, с екран с фосфор. През 1906 г. немците Макс Дикман и Густав Гладж произвеждат растерни изображения за първи път в CRT. През 1907 г. руският учен Борис Розинг използва CRT в приемащия край на експериментален видео сигнал, за да формира картина. Той успя да покаже прости геометрични фигури върху екрана. Телевизията (TV), понякога съкратена до теле или телеси, е телекомуникационна среда, използвана за предаване на движещи се изображения в монохром (черно и бяло), или в цвят, и в две или три измерения и звук. Терминът може да се отнася до телевизор, телевизионно предаване или носител на телевизионно предаване. Телевизията е масова среда за реклама, развлечения, новини и спорт.",
    },
    {
        contenttext: "Цифровата телевизия (DTV) е предаване на аудио и видео чрез цифрово обработени и мултиплексирани сигнали, за разлика от напълно аналоговите и канално разделени сигнали, използвани от аналоговата телевизия. Поради компресията на данни, цифровата телевизия може да поддържа повече от една програма в една и съща честотна лента на канала. Това е иновативна услуга, която представлява най-значимото развитие в телевизионната технология за излъчване, откакто цветната телевизия се появи през 50-те години на миналия век. Корените на цифровата телевизия са обвързани много тясно с наличието на евтини, високоефективни компютри. Едва през 90-те години цифровата телевизия става осъществима По-рано цифровата телевизия не беше практически осъществима поради непрактически високите изисквания за честотна лента на некомпресирано цифрово видео, изискващи около 200 Mbit / s бита скорост за телевизионен (SDTV) сигнал със стандартна разделителна способност, [140] и повече 1 Gbit / s за телевизия с висока разделителна способност (HDTV).",
    },
    {
        contenttext: "Появата на цифрова телевизия позволи иновации като смарт телевизорите. Интелигентната телевизия, понякога наричана свързана телевизия или хибридна телевизия, е телевизор или телевизор с интегрирани функции на Интернет и Web 2.0 и е пример за технологично сближаване между компютри, телевизори и приемници. Освен традиционните функции на телевизорите и телевизионните приемници, предоставени чрез традиционните излъчващи медии, тези устройства могат да предоставят също така и интернет телевизия, онлайн интерактивни медии, съдържание в най-горната част, както и поточни медии по заявка и достъп до домашна мрежа , Тези телевизори се предлагат предварително заредени с операционна система. Основната идея за използване на три монохромни изображения за създаване на цветно изображение беше експериментирана с почти веднага след като първо бяха изградени черно-белите телевизори. Въпреки че той не дава практически подробности, сред най-ранните публикувани предложения за телевизия е едно от Морис Льо Блан през 1880 г. за цветна система, включваща първите споменавания в телевизионната литература за сканиране на линии и кадри.",
    },
];

function getNextcontent(){
    if (index < contentt.length)
        return contentt[index++];
    else {
        return null;
    }
}



