var index = 0;
var contentt = [
    {
        contenttext: "Apple (чете се Епъл или Апъл) е американска мултинационална корпорация за производство и продажба на потребителска електроника, компютърен софтуер и персонални компютри. Най-известните продукти на компанията са персоналните компютри Macintosh, операционната система Mac OS X, портативните мултимедийни плеъри iPod, мултимедийния браузър iTunes, уеб браузъра Safari и мобилната операционна система iOS. Към 24 септември 2011 г. тя управлява 357 магазина за продажба на дребно в 11 страни и онлайн магазин, където се продават софтуерни и хардуерни продукти. Към септември 2011 г. Apple е компанията с най-голяма пазарна капитализация и най-голямата технологична компания по приход и печалба в света. ",
    },
    {
        contenttext: "Компанията е основана на 1 април 1976 г. в Купертино, Калифорния, в Силициевата долина от Стив Джобс, Стийв Возняк и Роналд Уейн. В продължение на 30 години тя носи името Apple Computer, Inc., докато на 9 януари 2007 премахва „Computer Inc.“ от името си, за да подчертае своето разширение към пазара за потребителска електроника – в допълнение на пазара за персонални компютри. Към края на финансовата 2011 г., на 24 септември 2011 г. в целия свят за Apple работят 60 400 служители на пълен работен ден и 2900 временно заети, които реализират годишни продажби за 108,3 млрд. долара. ",
    },
    {
        contenttext: "Apple притежава особена репутация в света на потребителската електроника, дължаща се на нейната задълбочена философия за продуктовия дизайн и на нейните отличителни рекламни кампании. В това се включва и клиентска база, която е вярна на компанията и марката, особено в Съединените щати. През август 2012 г. компанията става най-богатата компания в света с пазарна капитализация от 623 млрд. щатски долара, задминавайки стойността на Microsoft от 1999 г. (620,58 млрд. щатски долара). На 2 август 2018 година пазарната капитализация на Apple надминава 1 трилион (1000 млрд.) щатски долара. ",
    },
];

function getNextcontent(){
    if (index < contentt.length)
        return contentt[index++];
    else {
        return null;
    }
}



