var index = 0;
var contentt = [
    {
        contenttext: "Microsoft Corporation (чете се Майкрософт корпорейшън) е американска транснационална компания, развиваща дейност в областта на компютърните технологии и разработката на софтуер. Седалището ѝ е разположено в гр. Редмънд, САЩ, най-известните ѝ продукти са операционната система Windows, пакетът от текстообработващи програми Microsoft Office, Xbox сериите от игрални конзоли, Internet Explorer, Visual Studio и други.",
    },
    {
        contenttext: "Тя е първият по големина доставчик на софтуер и услуги в областта на информационните технологии с обем на продажбите в този сектор от 65,7 милиарда долара и общ обем на продажбите от 77,85 милиарда долара за 2013г. Името „Microsoft“ означава програми за микрокомпютри, които сега често се свеждат до две букви - MS. Компанията е основана на 4 април 1975 г. от Бил Гейтс и Пол Алън. Компанията е обвинявана няколко пъти в злоупотреба с монополното си положение. Съществува и български филиал на фирмата, „Microsoft България“ ООД. ",
    },
    {
        contenttext: "През 1999 г. компанията става най-скъпата компания в света с пазарна капитализация от 620,58 млрд. щатски долара. През август 2012 г. Apple подобрява този рекорд, като постига пазарна капитализация от 623 млрд. щатски долара.  ",
    },
];

function getNextcontent(){
    if (index < contentt.length)
        return contentt[index++];
    else {
        return null;
    }
}



