var index = 0;
var contentt = [
    {
        contenttext: "След като Съветският съюз изстрелва в орбита „Спутник“, през февруари 1958 година в Департамента на отбраната в Съединените щати се създава Агенцията за сложни изследователски проекти (Advanced Research Projects Agency, ARPA), с цел възстановяване на американското техническо превъзходство. Към нея е създадена Служба за технологията за обработка на информация (Information Processing Technology Office, IPTO), която трябва да продължи разработките на програмата Полуавтоматична наземна среда, свързала за пръв път в мрежа радарните системи в цялата страна. Задачата на IPTO е да подобри надеждността на военните комуникационни мрежи и като първа стъпка да свърже компютърните мрежи на няколко централни военни структури. ",
    },
    {
        contenttext: "На 29 октомври 1969 година в Менло парк, Калифорния, ARPA прави демонстрация на комуникация между компютри, посредством обмен на пакети. Така два компютъра са свързани в мрежа, която впоследствие се разраства и става известна под името ARPANET. През следващите години ARPANET се превръща в световна мрежа. Службата е оглавена от Джоузеф Карл Робнет Ликлайдер, който има значителен опит в компютърните мрежи и е привърженик на създаването на универсална мрежа. ",
    },
    {
        contenttext: "Думата Интернет се използва за първи път за описание на междумрежовото свързване в единна глобална компютърна мрежа, която използва протоколния стек TCP/IP. Това става в публикуваната през декември 1974 година спецификация на протокола TCP, написана от Винт Сърф, Йожен Далал и Карл Съншайн. През следващите години идеята за TCP/IP се развива и реализира в някои операционни системи. През 1981 г. ARPANET е разширена, след като Националната научна фондация (на английски: National Science Foundation, NSF) финансира свързването между научни организации (на английски: Computer Science Network, CSNET). През 1982 г. протоколът TCP/IP е стандартизиран, което позволява свързването и на други страни през следващите години в това, което добива популярност като Интернет. ",
    },
];

function getNextcontent(){
    if (index < contentt.length)
        return contentt[index++];
    else {
        return null;
    }
}



